/*
خسته نباشید، مسیر طولانی بود ولی به سلامت به خط پایان رسیدیم
امیدوارم این پروژه و توضیحاتی که ارائه شد بهتون کمک کرده باشه
و تبدیل به منشا الهامی بشه برای انجام کارهای بزرگتر

اگر میخواهید توی این حرکت سهیم باشید میتونید از طریق زیر این کارو انجام بدید
- کانتریبیوت توی سورس کد
- نوشتن پلاگین برای vscode
- ساخت playground
- ثبت ایشو و باگ
- ساخت یک وبسایت معرفی ساده
- معرفی به بقیه افرادی که به این حوزه علاقمند هستند ولی نمیدونند از کجا شروع کنند
- نوشتن کد های ساده و انتشار اون در فضای مجازی
- اطلاع رسانی به نتورکتون در فجازی
- استار دادن توی گیت هاب
*/
package main

import (
	"log"
	"os"
	"strings"
	"time"
)

/*
در اینجا چک میکنیم که آیا پارامتر خط فرمانی ارسال شده است یا نه
مثال
kahroba main.kahroba
اگر فایلی در پارامتر خط فرمان وجود داشت آن را میخوانیم و اجرا میکنیم
در غیر اینصورت
REPL
را اجرا میکنیم
*/
func main() {
	if len(os.Args) < 2 {
		NewREPL()
		return
	}

	input, err := os.ReadFile(os.Args[1])
	if err != nil {
		log.Fatal(err)
	}
	str := string(input)
	str = strings.NewReplacer(`\n`, "\n", `\t`, "\t", `\r`, "\r").Replace(str)
	l := NewLexer(str)
	p := NewParser(l.tokens)
	scope := NewScope(nil)
	Eval(p.nodes, scope)
	time.Sleep(time.Second * 30)
}
